benchmark/old_256_64k_result.txt
Summary:
  Success rate:	100.00%
  Total:	15004.4336 ms
  Slowest:	72.1622 ms
  Fastest:	1.3043 ms
  Average:	4.2703 ms
  Requests/sec:	23339.0349

  Total data:	21.37 GiB
  Size/request:	64.00 KiB
  Size/sec:	1.42 GiB

Response time histogram:
   1.304 ms [1]      |
   8.390 ms [338929] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  15.476 ms [444]    |
  22.562 ms [45]     |
  29.647 ms [0]      |
  36.733 ms [0]      |
  43.819 ms [91]     |
  50.905 ms [5317]   |
  57.991 ms [3581]   |
  65.076 ms [1655]   |
  72.162 ms [79]     |

Response time distribution:
  10.00% in 1.8205 ms
  25.00% in 2.0603 ms
  50.00% in 2.5498 ms
  75.00% in 3.3577 ms
  90.00% in 4.3185 ms
  95.00% in 5.2789 ms
  99.00% in 53.2779 ms
  99.90% in 62.8358 ms
  99.99% in 68.7427 ms


Details (average, fastest, slowest):
  DNS+dialup:	35.9575 ms, 1.2432 ms, 64.3564 ms
  DNS-lookup:	0.0018 ms, 0.0010 ms, 0.0187 ms

Status code distribution:
  [200] 350142 responses

Error distribution:
  [47] aborted due to deadline