benchmark/patch_16k_result.txt
Summary:
  Success rate:	100.00%
  Total:	60.0121 sec
  Slowest:	3.7437 sec
  Fastest:	0.1961 sec
  Average:	0.7715 sec
  Requests/sec:	521.3453

  Total data:	482.61 MiB
  Size/request:	16.00 KiB
  Size/sec:	8.04 MiB

Response time histogram:
  0.196 sec [1]     |
  0.551 sec [11223] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.906 sec [10170] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.260 sec [5994]  |■■■■■■■■■■■■■■■■■
  1.615 sec [2350]  |■■■■■■
  1.970 sec [819]   |■■
  2.325 sec [280]   |
  2.679 sec [22]    |
  3.034 sec [16]    |
  3.389 sec [5]     |
  3.744 sec [7]     |

Response time distribution:
  10.00% in 0.3797 sec
  25.00% in 0.4735 sec
  50.00% in 0.6679 sec
  75.00% in 1.0127 sec
  90.00% in 1.3368 sec
  95.00% in 1.5422 sec
  99.00% in 1.9914 sec
  99.90% in 2.6441 sec
  99.99% in 3.5602 sec


Details (average, fastest, slowest):
  DNS+dialup:	0.0398 sec, 0.0085 sec, 0.0626 sec
  DNS-lookup:	0.0000 sec, 0.0000 sec, 0.0006 sec

Status code distribution:
  [200] 30887 responses

Error distribution:
  [400] aborted due to deadline