benchmark/patch_1_64k_result.txt
Summary:
  Success rate:	100.00%
  Total:	15004.7870 ms
  Slowest:	257.6901 ms
  Fastest:	1.2822 ms
  Average:	4.2997 ms
  Requests/sec:	23212.8587

  Total data:	21.26 GiB
  Size/request:	64.00 KiB
  Size/sec:	1.42 GiB

Response time histogram:
    1.282 ms [1]      |
   26.923 ms [348089] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   52.564 ms [53]     |
   78.205 ms [3]      |
  103.845 ms [3]      |
  129.486 ms [0]      |
  155.127 ms [0]      |
  180.768 ms [38]     |
  206.408 ms [24]     |
  232.049 ms [67]     |
  257.690 ms [6]      |

Response time distribution:
  10.00% in 2.6959 ms
  25.00% in 3.2846 ms
  50.00% in 4.0477 ms
  75.00% in 4.8397 ms
  90.00% in 6.2638 ms
  95.00% in 6.8358 ms
  99.00% in 7.6777 ms
  99.90% in 16.0158 ms
  99.99% in 218.1271 ms


Details (average, fastest, slowest):
  DNS+dialup:	19.6426 ms, 1.2591 ms, 34.8853 ms
  DNS-lookup:	0.0021 ms, 0.0014 ms, 0.0177 ms

Status code distribution:
  [200] 348284 responses

Error distribution:
  [20] aborted due to deadline